-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2026-09-07 15:49:22
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `newstore`
--

-- --------------------------------------------------------

--
-- 資料表結構 `product`
--

CREATE TABLE `product` (
  `p_id` int(10) NOT NULL COMMENT '產品編號',
  `classid` int(3) NOT NULL COMMENT '產品類別',
  `p_name` varchar(200) NOT NULL COMMENT '產品名稱',
  `p_intro` varchar(200) DEFAULT NULL COMMENT '產品簡介',
  `p_price` int(11) DEFAULT NULL COMMENT '產品單價',
  `p_open` tinyint(1) NOT NULL DEFAULT 1 COMMENT '上架',
  `p_content` text DEFAULT NULL COMMENT '產品詳細規格',
  `p_date` timestamp NULL DEFAULT current_timestamp() COMMENT '產品輸入日期'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `product`
--

INSERT INTO `product` (`p_id`, `classid`, `p_name`, `p_intro`, `p_price`, `p_open`, `p_content`, `p_date`) VALUES
(1, 11, '上衣 1\r\n', '極簡基礎款，怎麼搭都不出錯！\r\n', 390, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p> <br> <p>【商品規格】</p> <p>材質：棉 + 聚酯纖維</p> <p>尺寸：F Size (單一尺寸)</p>\r\n', '2026-08-16 11:45:51'),
(2, 12, '上衣2\r\n', '親膚質感給予全天候的舒適體感\r\n', 490, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p> <br> <p>【商品規格】</p> <p>材質：棉 + 聚酯纖維</p> <p>尺寸：F Size (單一尺寸)</p>\r\n', '2026-08-16 11:46:24'),
(3, 13, '上衣3', '親膚質感給予全天候的舒適體感', 490, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 11:58:27'),
(4, 11, '上衣4', '親膚質感給予全天候的舒適體感', 490, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 11:58:27'),
(5, 12, '上衣5', '親膚質感給予全天候的舒適體感', 490, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 11:58:27'),
(6, 13, '上衣6', '親膚質感給予全天候的舒適體感', 490, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 11:58:27'),
(7, 11, '上衣7', '親膚質感給予全天候的舒適體感', 490, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 11:58:27'),
(8, 12, '上衣8', '親膚質感給予全天候的舒適體感', 490, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 11:58:27'),
(9, 13, '上衣9', '親膚質感給予全天候的舒適體感', 490, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 11:58:27'),
(10, 11, '上衣 10', '極簡基礎款，怎麼搭都不出錯！', 1290, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 12:04:44'),
(11, 12, '上衣 11', '親膚質感給予全天候的舒適體感', 1390, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 12:04:44'),
(12, 13, '上衣 12', '單穿俐落', 1490, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 12:04:44'),
(51, 21, '下身1', '單穿俐落', 390, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 12:11:33'),
(52, 22, '下身2', '內搭豐富層次感', 490, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 12:11:33'),
(53, 23, '下身3', '實穿單品', 590, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 12:11:33'),
(54, 21, '下身4', '極簡基礎款，怎麼搭都不出錯！', 690, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 12:11:33'),
(55, 22, '下身5', '親膚質感給予全天候的舒適體感', 790, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 12:11:33'),
(56, 23, '下身6', '單穿俐落', 890, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 12:11:33'),
(57, 21, '下身7', '極簡基礎款，怎麼搭都不出錯！', 990, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 12:11:33'),
(58, 22, '下身8', '極簡基礎款，怎麼搭都不出錯！', 1090, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 12:11:33'),
(59, 23, '下身9', '親膚質感給予全天候的舒適體感', 1190, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 12:11:33'),
(60, 21, '下身10', '單穿俐落', 1290, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 12:11:33'),
(61, 22, '下身11', '極簡基礎款，怎麼搭都不出錯！', 1390, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 12:11:33'),
(62, 23, '下身12', '親膚質感給予全天候的舒適體感', 1490, 1, '<p>修身舒適，非常適合日常與上班穿搭！</p><br><p>【商品規格】</p><p>材質：棉 + 聚酯纖維</p><p>尺寸：F Size (單一尺寸)</p>', '2026-08-16 12:11:33');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`p_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product`
--
ALTER TABLE `product`
  MODIFY `p_id` int(10) NOT NULL AUTO_INCREMENT COMMENT '產品編號', AUTO_INCREMENT=63;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
